//{===========================================================================
//! @file       LFioninaTaskThree.cpp
//!
//! @brief      ИГРА "БРОДИЛКА"
//!
//!               $Date: 2021-06-23 $
//          (C) Фионина Людмила Евгеньевна, г. Самара, 2021
//}===========================================================================

# include "TXLib.h"
# include <stdlib.h>


//------------------------ ОСНОВНАЯ ФУНКЦИЯ--------------------------------------------
int main ()
    {
    txCreateWindow (1300, 800);

    HDC  background = txLoadImage ("fon.bmp");

    txBitBlt (0, 100, background);

    txDeleteDC (background);
    return 0;
    }

