//{===========================================================================
//! @file       Person.h
//!
//!             Класс ПОДАРОК
//!
//!@author  (C) Фионина Людмила Евгеньевна, г. Самара,
//!@date          2021
//!
//!
//!@par   Назначение
//!
//!       Класс Подарок - класс для создания объекта "Подарок" игры "Бродилка".
//!     Состоит из 5 компонент: координаты подарка на поле игры.
//!
//!     Включает функцию класса: рисование подарка.
//!
//!
//}===========================================================================


//{-----------------------------------------------------------------------------
//! Структура Подарка
//!
//! @param  x       координата по х
//!         y       координата по Y
//!
//}-----------------------------------------------------------------------------
struct Present
    {
    int x, y;

    void Draw (int num);
    };

//{-----------------------------------------------------------------------------
//! Функция рисования подарка при помощи спрайтовой анимации
//!
//! @param frame  кадр анимации персонажа при движении
//!
//}-----------------------------------------------------------------------------
void Present::Draw (int frame)
    {
    txTransparentBlt (txDC(), x, y, X_PRESENT, Y_PRESENT, SPRITE_PRESENT, frame*X_PRESENT, 0*Y_PRESENT, RGB(0,255,0));
    }
